In [2]:
import pandas as pd
students = ['AA','BB','CC']
pd.Series(students)

0    AA
1    BB
2    CC
dtype: object

In [3]:
numbers = [1,2,3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [4]:
students = ['AA','BB',None]
pd.Series(students)

0      AA
1      BB
2    None
dtype: object

In [5]:
numbers = [1,2,None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [6]:
import numpy as np
[np.nan == None, np.nan == np.nan, np.isnan(np.nan)]

[False, False, True]

In [7]:
students_scores = {'AA':'Phy','BB':'Chem','CC':'Eng'}
s = pd.Series(students_scores)
s

AA     Phy
BB    Chem
CC     Eng
dtype: object

In [8]:
s.index

Index(['AA', 'BB', 'CC'], dtype='object')

In [9]:
s = pd.Series(['Phy', 'Chem', 'Eng'], index=['AA', 'BB', 'CC'])
s

AA     Phy
BB    Chem
CC     Eng
dtype: object

In [10]:
students_scores = {'AA':'Phy','BB':'Chem','CC':'Eng'}
s = pd.Series(students_scores, index=['AA','BB','DD'])
s

AA     Phy
BB    Chem
DD     NaN
dtype: object

In [11]:
students_classes = {'AA':'Phy','BB':'Chem','CC':'Eng', 'DD':'Hist'}
s = pd.Series(students_classes)
s.iloc[3]

'Hist'

In [12]:
s.loc['BB']

'Chem'

In [13]:
s[3] # position

'Hist'

In [14]:
s['BB'] # label

'Chem'

In [15]:
class_code = {99:'Phy', 100:'Chem',101:'Eng',103:'Hist'}
s = pd.Series(class_code)
s.iloc[0] # s[0] -> error

'Phy'

In [16]:
grades = pd.Series([90,80,70,60])
total = np.sum(grades)
print(total/len(grades))

75.0

In [17]:
numbers = pd.Series(np.random.randint(0,1000,10000))
numbers.head()

0    467
1     42
2     79
3    801
4    461
dtype: int64

In [18]:
%%timeit -n 100
total = 0
for number in numbers:
    total += number
total/len(numbers)

1.81 ms ± 472 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [19]:
%%timeit -n 100
total = np.sum(numbers)
total/len(numbers)

139 µs ± 32.6 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [20]:
numbers += 2
numbers.head()

0    469
1     44
2     81
3    803
4    463
dtype: int64

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,10000))
for label, value in numbers.iteritems():
    s.loc[label] = value+2

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,10000))
s += 2

In [ ]:
s = pd.Series([1,2,3])
s.loc['AA'] = 102
s

In [ ]:
aa_classes = {'AA':'Phy','AA':'Chem','AA':'Eng', 'AA':'Hist'}
aa_classes = pd.Series(aa_classes)
aa_classes

In [ ]:
aa_classes = pd.Series(['Phy', 'Chem', 'Eng', 'Hist'], index=['AA', 'AA', 'AA', 'AA'])
aa_classes

In [ ]:
students_classes = pd.Series(['Phy', 'Chem', 'Eng', 'Hist'], index=['AA', 'BB', 'CC', 'DD'])
all_stu_class = students_classes.append(aa_classes)
all_stu_class

In [ ]:
students_classes

In [ ]:
all_stu_class.loc['AA']

In [ ]:
import pandas as pd

record1 = pd.Series({'Name':'AA', 'Class':'Phy', 'Score':85})
record2 = pd.Series({'Name':'BB', 'Class':'Chem', 'Score':82})
record3 = pd.Series({'Name':'CC', 'Class':'Bio', 'Score':98})

df = pd.DataFrame([record1,record2,record3], index=['school1','school2','school3'])
df.head()

In [ ]:
students = [{'Name':'AA', 'Class':'Phy', 'Score':85},
            {'Name':'BB', 'Class':'Chem', 'Score':82},
            {'Name':'CC', 'Class':'Bio', 'Score':98}]
df = pd.DataFrame(students, index=['school1','school2','school1'])
df

In [ ]:
df.loc['school2']

In [ ]:
type(df.loc['school2'])

In [ ]:
type(df.loc['school1'])

In [ ]:
df.loc['school1', 'Name']

In [ ]:
df.T

In [ ]:
df.T.loc['Name']

In [ ]:
df['Name']

In [ ]:
type(df['Name'])

In [ ]:
df.loc['school1']['Name']

In [ ]:
print(type(df.loc['school1']))
print(type(df.loc['school1']['Name']))

In [ ]:
df.loc[:,['Name','Score']]

In [ ]:
# drop: give new df
df.drop('school1')

In [ ]:
df

In [ ]:
copy_df = df.copy()
copy_df.drop('Name', inplace=True, axis=1)
copy_df

In [ ]:
del copy_df['Class']
copy_df

In [ ]:
df['ClassRanking'] = None
df

In [1]:
import pandas as pd

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [2]:
x = obj2['California']
obj2['California'] != x

True

In [3]:
obj2['California'] == None

False

In [4]:
import math
math.isnan(obj2['California'])

True

In [5]:
obj3['California']

True

In [6]:
obj3

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [10]:
import pandas as pd
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [15]:
students = [{'Name':'AA', 'Class':'Phy', 'Score':85},
            {'Name':'BB', 'Class':'Chem', 'Score':82},
            {'Name':'CC', 'Class':'Bio', 'Score':98}]
df = pd.DataFrame(students, index=['school1','school2','school1'])

# df.rename(mapper = lambda x:x.upper(), axis=1)
# df

# df = df.rename(mapper = lambda x:x.upper(), axis=1)
# df

# df = df.rename(mapper = lambda x:x.upper(), axis='columns')
# df

df.rename(mapper = lambda x:x.upper(), axis=1, inplace='True')
df

        NAME CLASS  SCORE
school1   AA   Phy     85
school2   BB  Chem     82
school1   CC   Bio     98

In [12]:
df = df.rename(mapper = lambda x:x.upper(), axis=1)
df

        NAME CLASS  SCORE
school1   AA   Phy     85
school2   BB  Chem     82
school1   CC   Bio     98

In [24]:
toefl_score = [
    {'Serial No':1, 'gre score':337, 'toefl score':118},
    {'Serial No':2, 'gre score':327, 'toefl score':108},
    {'Serial No':3, 'gre score':317, 'toefl score':100},
    {'Serial No':4, 'gre score':307},
    {'Serial No':4, 'toefl score':107}
]
df = pd.DataFrame(toefl_score)
df[df['toefl score'] > 105].dropna()

   Serial No  gre score  toefl score
0          1      337.0        118.0
1          2      327.0        108.0

In [30]:
locations = [
    {'one':0, 'two':1, 'three':2},
    {'one':4, 'two':5, 'three':6},
    {'one':8, 'two':9, 'three':10}
]
df = pd.DataFrame(locations, index = ['Ohio', 'Colorado', 'Utah'])
# df.drop(['Ohio', 'Utah'])
# df.drop('Ohio')
df.drop('two', axis =1)  # df.drop('two') should claim "axis"

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10

In [38]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
# s1.loc[1]
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})
# s2.loc[1] # Error!!
# s2[1] # 2
# s2.iloc[1] # 2

Alice    2
Molly    3
dtype: int64

In [39]:
aa_classes = pd.Series(['Phy', 'Chem', 'Eng', 'Hist'], index=['AA', 'AA', 'AA', 'AA'])
aa_classes['AA']

AA     Phy
AA    Chem
AA     Eng
AA    Hist
dtype: object

In [42]:
toefl_score = [
    {'Serial No':1, 'gre score':337, 'toefl score':115},
    {'Serial No':2, 'gre score':327, 'toefl score':108},
    {'Serial No':3, 'gre score':317, 'toefl score':100},
    {'Serial No':4, 'gre score':307},
    {'Serial No':4, 'toefl score':105}
]
df = pd.DataFrame(toefl_score)
df[(df['toefl score'].isin(range(106,115)))]

   Serial No  gre score  toefl score
1          2      327.0        108.0

In [45]:
(df['toefl score'] > 105 ) & (df['toefl score'] < 115 ) # Will give boll Series
df[(df['toefl score'] > 105 ) & (df['toefl score'] < 115 )]

0    False
1     True
2    False
3    False
4    False
Name: toefl score, dtype: bool

In [47]:
df[(df['toefl score'].gt(105) ) & (df['toefl score'].lt(115) )]

   Serial No  gre score  toefl score
1          2      327.0        108.0

In [52]:
locations = [
    {'Name':'Alice', 'Age':1, 'Gender':'F'},
    {'Name':'Jack', 'Age':5, 'Gender':'M'},
    {'Name':'Alice', 'Age':5, 'Gender':'M'}
]
df = pd.DataFrame(locations, index = ['Mathmatics', 'Sociology', 'Math'])
df.T['Mathmatics']

Name      Alice
Age           1
Gender        F
Name: Mathmatics, dtype: object